#+TITLE: Notas de clase: Resumen de Distribuciones de Probabilidad Discretas y ejemplos en R
#+INCLUDE: "~/org/uni/org/config.org"
#+date: Abril 2022
#+author: Manuel Fuica Morales
:sessions:
#+PROPERTY: header-args:R :session code :exports both :results replace
:end:

@@latex:\clearpage@@

#+begin_src R :session code :exports results :results silent
library("extraDistr")
#+end_src

** Binomial

Sin ejemplo en este caso, es la más popular y
hay muchos ejemplos en internet.

La sintaxis en R para calcular la Binomial es:

1) \(P(X=x)\)
   : dbinom(x,size,prob)
   : sum(dbinom(x1:x2,size,prob)) # con rango

   - =size=: el número de intentos.
   - =prob=: probabilidad de cada intento. 
   - El =sum(...)= te entrega el valor total,
     si evalúas =dbinom(x1:x2,size,prob)= sin
     rodearlo con el =sum(...)=, =R= te entrega
     los valores de la probabilidad en cada
     uno de los puntos del rango.
     
2) \(P(X \leq x)\)
   : pbinom(q,size,prob)

   - =q=, lo mismo que el =x= en el punto =1=,
     pero =R= lo necesita denominado como =q=.
     Un =q=3= sería lo mismo que un =x=0:3=

   #+begin_src R :session code
   binomial_con_d <- sum(dbinom(x=0:4, size=12, prob=0.2))
   binomial_con_p <- pbinom(q=4, size=12, prob=0.2)

   (binomial_con_d) - (binomial_con_d)
   #+end_src

   #+RESULTS:
   : 0

** Multinomial

Referencia:
- [[id:288c060a-4b71-4261-ba11-1176c956af9b][Multinomial: generalización de Binomial]]
  - [[id:4f590b01-66c5-4af2-b87b-7a2dd37b1ea2][Ejemplo]] 

    
Tienes un universo de personas donde el tipo
de sangre esta distribuido:

| Tipo de sangre | O     | A     | B     | AB    |
|----------------+-------+-------+-------+-------|
| Probabilidad   | =.44= | =.42= | =.10= | =.04= |

Eliges 10 personas, ¿Cuál es la probabilidad
de que de esas 10 personas =6= sean de tipo
=O=, =2= de tipo =A=, =1B= y =1AB=?

\begin{align*}
P(x_{1}=6,x_{2}=2,x_{3}=1,x_{4}=1)=
\frac{10!}{6!\ 2!\ 1!\ 1!}
0.44^{6}\ 0.42^{2}\ 0.10^{1}\ 0.04^{1}
\approx 0.01290
\end{align*}

Eso en =R= se calcula con la siguiente sintaxis:

#+begin_src R :session code
freq <- c(6, 2, 1, 1)
particiones <- c(.44, .42, .10, .04)
dmultinom(x=freq,prob=particiones)
#+end_src

#+RESULTS:
: 0.0129025387431199

** Binomial Negativa

Referencia:
- [[id:57844672-cbbf-4796-9104-f54eb0bcda6d][Binomial Negativa: generalización de Geométrica]]
  - [[id:d160ff79-b9da-48d1-96e8-70d376ca0c19][Ejemplo]]


Un encuestador necesita 3 o más personas
encuestadas para finalizar el día. 9 de cada
100 personas llamadas responden la encuesta.
¿Cuál es la probabilidad de que la tercera
encuesta completada se alcance en la
décima llamada?

- Probabilidad de éxito de cada llamada \(p=0.09\).
- Tercera encuesta completada \((r=3)\) en el
  décimo intento \((x=10)\).

\begin{align*}
P(x)=
\binom{x-1}{r-1} (1-p)^{x-r} p^{r}
\end{align*}

\begin{align*}
P(x=10)=
\binom{(10)-1}{(3)-1}
(1-(0.09))^{(10)-(3)}(0.09)^{(3)}
\approx 0.0135
\end{align*}

Sin embargo, la sintaxis de =R= para
un escenario Binomial Negativo entiende
la variable aleatoria \(X\), denotada
como \(n\), como el número de /fracasos/
/acumulados/ antes de el \(r\)-ésimo éxito.

#+begin_src R :session code
p=0.09
r=3 # éxitos
n=10-r # (fracasos) = (total de intentos) - (éxitos)
dnbinom(x = n, size = r, prob = p)
#+end_src

#+RESULTS:
: 0.0135618761920132

** Hipergeométrica

Referencia:
- [[id:4f33bad8-7720-4585-8063-267a3f231a58][Hipergeométrica]]
  - [[id:a4c556c6-9245-4f4b-bbb2-70165bbfaa94][Ejemplo]]


Un colegio tiene 2000 estudiantes, 1100 mujeres
y 900 hombres. 10 estudiantes son seleccionados
al azar, ¿Cuál es la probabilidad de que
de los 10 estudiantes seleccionados, 7 sean
mujeres?:


: m=1100: éxitos en la población total
: n=900 : fallos en la población total
: k=10  : elementos seleccionados
: x=7   : número de éxitos seleccionados

#+begin_src R :session code
x <- 7
m <- 1100
n <- 900
k <- 10
dhyper(x, m, n, k)
#+end_src

#+RESULTS:
: 0.166490057068677

*** Ejemplo

Referencia:
- [[id:e0f06c88-3a83-4ac3-a3e3-3c83803cb0b5][Hipergeométrica Multivariada: generalización de la Hipergeométrica]]
  - [[id:bb8c0ca5-1de2-4108-956e-575741826a73][Ejemplo]]


Tienes una caja con =8= bolas rojas, =3= amarillas
y =9= blancas. ¿Cuál es la probabilidad de
sacar al azar /sin/ /devolver/ =2= rojas,
=1= amarilla y =3= blancas?

La sintaxis de esta distribución para R es:
: dmvhyper(x=muestra,n=freq,k=6)
donde:
- =x=: vector éxito en la muestra
- =n=: vector éxito en la población
- =k=: número de elementos de la muestra[fn:6]

#+begin_src R :session code
muestra<-c('rojo' = 2, 'amarillo' = 1, 'blanco' = 3)
freq<-c('rojo' = 8, 'amarillo' = 3, 'blanco' = 9)
dmvhyper(x=muestra,n=freq,k=6)
#+end_src

#+RESULTS:
: 0.18204334365325

Otro ejemplo online:
- [[https://avrilomics.blogspot.com/2017/11/multivariate-hypergeometric.html][avrilomics.blogspot.com/2017/11/multivariate-hypergeometric.html]]

-----
@@latex:\clearpage@@
